; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	thermograph2 - mode
	thermograph0 - mode
	spectrograph1 - mode
	infrared3 - mode
	GroundStation0 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation6 - direction
	Star5 - direction
	Star2 - direction
	GroundStation1 - direction
	Star7 - direction
	Planet8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Star12 - direction
	Planet13 - direction
	Planet14 - direction
	Star15 - direction
	Planet16 - direction
	Star17 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 thermograph2)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet13)
	(supports instrument2 infrared3)
	(calibration_target instrument2 GroundStation1)
	(supports instrument3 thermograph2)
	(supports instrument3 spectrograph1)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation3)
)
(:goal (and
	(pointing satellite0 GroundStation3)
	(have_image Star7 spectrograph1)
	(have_image Planet8 thermograph0)
	(have_image Star9 spectrograph1)
	(have_image Phenomenon10 spectrograph1)
	(have_image Planet11 thermograph2)
	(have_image Star12 thermograph0)
	(have_image Planet13 infrared3)
	(have_image Planet14 spectrograph1)
	(have_image Star15 thermograph0)
	(have_image Planet16 spectrograph1)
	(have_image Star17 spectrograph1)
))

)

; plan
1. (turn_to satellite1 groundstation1 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 groundstation1)
   goals met: 0 of 12
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 12
3. (calibrate satellite1 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 0 of 12
4. (turn_to satellite1 planet13 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 planet13)
   goals met: 0 of 12
5. (take_image satellite1 planet13 instrument2 infrared3)
   added: (have_image planet13 infrared3)
   goals met: 1 of 12
6. (turn_to satellite1 groundstation1 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 groundstation1)
   goals met: 1 of 12
7. (switch_off instrument2 satellite1)
   deleted: (power_on instrument2)
   added: (power_avail satellite1)
   goals met: 1 of 12
8. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 12
9. (calibrate satellite1 instrument3 groundstation1)
   added: (calibrated instrument3)
   goals met: 1 of 12
10. (turn_to satellite1 phenomenon10 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 phenomenon10)
   goals met: 1 of 12
11. (turn_to satellite0 groundstation3 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 groundstation3)
   goals met: 2 of 12
12. (take_image satellite1 phenomenon10 instrument3 spectrograph1)
   added: (have_image phenomenon10 spectrograph1)
   goals met: 3 of 12
13. (turn_to satellite1 planet11 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 planet11)
   goals met: 3 of 12
14. (take_image satellite1 planet11 instrument3 thermograph2)
   added: (have_image planet11 thermograph2)
   goals met: 4 of 12
15. (turn_to satellite1 planet14 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet14)
   goals met: 4 of 12
16. (take_image satellite1 planet14 instrument3 spectrograph1)
   added: (have_image planet14 spectrograph1)
   goals met: 5 of 12
17. (turn_to satellite1 planet16 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 planet16)
   goals met: 5 of 12
18. (take_image satellite1 planet16 instrument3 spectrograph1)
   added: (have_image planet16 spectrograph1)
   goals met: 6 of 12
19. (turn_to satellite1 planet8 planet16)
   deleted: (pointing satellite1 planet16)
   added: (pointing satellite1 planet8)
   goals met: 6 of 12
20. (take_image satellite1 planet8 instrument3 thermograph0)
   added: (have_image planet8 thermograph0)
   goals met: 7 of 12
21. (turn_to satellite1 star12 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star12)
   goals met: 7 of 12
22. (take_image satellite1 star12 instrument3 thermograph0)
   added: (have_image star12 thermograph0)
   goals met: 8 of 12
23. (turn_to satellite1 star15 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star15)
   goals met: 8 of 12
24. (take_image satellite1 star15 instrument3 thermograph0)
   added: (have_image star15 thermograph0)
   goals met: 9 of 12
25. (turn_to satellite1 star17 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 star17)
   goals met: 9 of 12
26. (take_image satellite1 star17 instrument3 spectrograph1)
   added: (have_image star17 spectrograph1)
   goals met: 10 of 12
27. (turn_to satellite1 star7 star17)
   deleted: (pointing satellite1 star17)
   added: (pointing satellite1 star7)
   goals met: 10 of 12
28. (take_image satellite1 star7 instrument3 spectrograph1)
   added: (have_image star7 spectrograph1)
   goals met: 11 of 12
29. (turn_to satellite1 star9 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star9)
   goals met: 11 of 12
30. (take_image satellite1 star9 instrument3 spectrograph1)
   added: (have_image star9 spectrograph1)
   goals met: 12 of 12
